bench_db/select_group_by/test/32_100000
sysbench 0.5:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 32
Report intermediate results every 10 second(s)
Initializing random number generator from timer.

Random number generator seed is 0 and will be ignored


Threads started!

[  10s] threads: 32, tps: 0.00, reads/s: 3363.00, writes/s: 0.00 response time: 43.03ms (95%)
[  20s] threads: 32, tps: 0.00, reads/s: 3807.68, writes/s: 0.00 response time: 40.06ms (95%)
[  30s] threads: 32, tps: 0.00, reads/s: 3575.59, writes/s: 0.00 response time: 41.64ms (95%)
[  40s] threads: 32, tps: 0.00, reads/s: 3632.01, writes/s: 0.00 response time: 41.19ms (95%)
[  50s] threads: 32, tps: 0.00, reads/s: 3733.19, writes/s: 0.00 response time: 41.09ms (95%)
[  60s] threads: 32, tps: 0.00, reads/s: 3593.02, writes/s: 0.00 response time: 42.31ms (95%)
[  70s] threads: 32, tps: 0.00, reads/s: 3833.69, writes/s: 0.00 response time: 38.80ms (95%)
[  80s] threads: 32, tps: 0.00, reads/s: 3557.10, writes/s: 0.00 response time: 41.16ms (95%)
[  90s] threads: 32, tps: 0.00, reads/s: 3831.26, writes/s: 0.00 response time: 38.56ms (95%)
[ 100s] threads: 32, tps: 0.00, reads/s: 3327.84, writes/s: 0.00 response time: 42.93ms (95%)
[ 110s] threads: 32, tps: 0.00, reads/s: 3716.95, writes/s: 0.00 response time: 40.45ms (95%)
[ 120s] threads: 32, tps: 0.00, reads/s: 3630.46, writes/s: 0.00 response time: 41.94ms (95%)
[ 130s] threads: 32, tps: 0.00, reads/s: 3729.05, writes/s: 0.00 response time: 41.65ms (95%)
[ 140s] threads: 32, tps: 0.00, reads/s: 3658.96, writes/s: 0.00 response time: 41.61ms (95%)
[ 150s] threads: 32, tps: 0.00, reads/s: 3318.51, writes/s: 0.00 response time: 43.83ms (95%)
[ 160s] threads: 32, tps: 0.00, reads/s: 3800.42, writes/s: 0.00 response time: 39.82ms (95%)
[ 170s] threads: 32, tps: 0.00, reads/s: 3605.66, writes/s: 0.00 response time: 42.32ms (95%)
[ 180s] threads: 32, tps: 0.00, reads/s: 3735.97, writes/s: 0.00 response time: 41.49ms (95%)
OLTP test statistics:
    queries performed:
        read:                            654495
        write:                           0
        other:                           0
        total:                           654495
    transactions:                        0      (0.00 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 654495 (3635.98 per sec.)
    other operations:                    0      (0.00 per sec.)

General statistics:
    total time:                          180.0053s
    total number of events:              654495
    total time taken by event execution: 5724.3961s
    response time:
         min:                                  0.29ms
         avg:                                  8.75ms
         max:                                559.46ms
         approx.  95 percentile:              41.22ms

Threads fairness:
    events (avg/stddev):           20452.9688/1999.97
    execution time (avg/stddev):   178.8874/0.14

sysbench 0.5:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 32
Report intermediate results every 10 second(s)
Initializing random number generator from timer.

Random number generator seed is 0 and will be ignored


Threads started!

[  10s] threads: 32, tps: 0.00, reads/s: 3591.49, writes/s: 0.00 response time: 40.90ms (95%)
[  20s] threads: 32, tps: 0.00, reads/s: 3827.25, writes/s: 0.00 response time: 38.97ms (95%)
[  30s] threads: 32, tps: 0.00, reads/s: 3692.13, writes/s: 0.00 response time: 39.95ms (95%)
[  40s] threads: 32, tps: 0.00, reads/s: 3661.55, writes/s: 0.00 response time: 39.49ms (95%)
[  50s] threads: 32, tps: 0.00, reads/s: 3636.64, writes/s: 0.00 response time: 40.07ms (95%)
[  60s] threads: 32, tps: 0.00, reads/s: 3537.74, writes/s: 0.00 response time: 41.64ms (95%)
[  70s] threads: 32, tps: 0.00, reads/s: 3837.06, writes/s: 0.00 response time: 37.69ms (95%)
[  80s] threads: 32, tps: 0.00, reads/s: 3570.13, writes/s: 0.00 response time: 42.79ms (95%)
[  90s] threads: 32, tps: 0.00, reads/s: 3690.16, writes/s: 0.00 response time: 38.26ms (95%)
[ 100s] threads: 32, tps: 0.00, reads/s: 3631.39, writes/s: 0.00 response time: 40.31ms (95%)
[ 110s] threads: 32, tps: 0.00, reads/s: 3828.25, writes/s: 0.00 response time: 38.01ms (95%)
[ 120s] threads: 32, tps: 0.00, reads/s: 3434.69, writes/s: 0.00 response time: 41.32ms (95%)
[ 130s] threads: 32, tps: 0.00, reads/s: 3850.00, writes/s: 0.00 response time: 39.57ms (95%)
[ 140s] threads: 32, tps: 0.00, reads/s: 3652.48, writes/s: 0.00 response time: 40.79ms (95%)
[ 150s] threads: 32, tps: 0.00, reads/s: 3755.17, writes/s: 0.00 response time: 39.03ms (95%)
[ 160s] threads: 32, tps: 0.00, reads/s: 3514.79, writes/s: 0.00 response time: 40.21ms (95%)
[ 170s] threads: 32, tps: 0.00, reads/s: 3622.24, writes/s: 0.00 response time: 41.47ms (95%)
[ 180s] threads: 32, tps: 0.00, reads/s: 3787.85, writes/s: 0.00 response time: 38.66ms (95%)
OLTP test statistics:
    queries performed:
        read:                            661245
        write:                           0
        other:                           0
        total:                           661245
    transactions:                        0      (0.00 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 661245 (3673.41 per sec.)
    other operations:                    0      (0.00 per sec.)

General statistics:
    total time:                          180.0085s
    total number of events:              661245
    total time taken by event execution: 5724.2069s
    response time:
         min:                                  0.27ms
         avg:                                  8.66ms
         max:                                416.76ms
         approx.  95 percentile:              39.88ms

Threads fairness:
    events (avg/stddev):           20663.9062/1426.11
    execution time (avg/stddev):   178.8815/0.16

sysbench 0.5:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 32
Report intermediate results every 10 second(s)
Initializing random number generator from timer.

Random number generator seed is 0 and will be ignored


WARNING: timer was never started
Threads started!

[  10s] threads: 32, tps: 0.00, reads/s: 3797.64, writes/s: 0.00 response time: 41.27ms (95%)
[  20s] threads: 32, tps: 0.00, reads/s: 3625.40, writes/s: 0.00 response time: 39.78ms (95%)
[  30s] threads: 32, tps: 0.00, reads/s: 3863.89, writes/s: 0.00 response time: 37.97ms (95%)
[  40s] threads: 32, tps: 0.00, reads/s: 3312.62, writes/s: 0.00 response time: 41.75ms (95%)
[  50s] threads: 32, tps: 0.00, reads/s: 3826.83, writes/s: 0.00 response time: 38.70ms (95%)
[  60s] threads: 32, tps: 0.00, reads/s: 3659.77, writes/s: 0.00 response time: 40.87ms (95%)
[  70s] threads: 32, tps: 0.00, reads/s: 3764.93, writes/s: 0.00 response time: 39.89ms (95%)
[  80s] threads: 32, tps: 0.00, reads/s: 3718.60, writes/s: 0.00 response time: 39.73ms (95%)
[  90s] threads: 32, tps: 0.00, reads/s: 3661.76, writes/s: 0.00 response time: 40.47ms (95%)
[ 100s] threads: 32, tps: 0.00, reads/s: 3835.08, writes/s: 0.00 response time: 39.37ms (95%)
[ 110s] threads: 32, tps: 0.00, reads/s: 3630.87, writes/s: 0.00 response time: 40.56ms (95%)
[ 120s] threads: 32, tps: 0.00, reads/s: 3806.38, writes/s: 0.00 response time: 38.49ms (95%)
[ 130s] threads: 32, tps: 0.00, reads/s: 3645.65, writes/s: 0.00 response time: 40.86ms (95%)
[ 140s] threads: 32, tps: 0.00, reads/s: 3823.21, writes/s: 0.00 response time: 38.53ms (95%)
[ 150s] threads: 32, tps: 0.00, reads/s: 3679.41, writes/s: 0.00 response time: 40.63ms (95%)
[ 160s] threads: 32, tps: 0.00, reads/s: 3817.94, writes/s: 0.00 response time: 38.27ms (95%)
[ 170s] threads: 32, tps: 0.00, reads/s: 3668.20, writes/s: 0.00 response time: 39.61ms (95%)
[ 180s] threads: 32, tps: 0.00, reads/s: 3763.65, writes/s: 0.00 response time: 39.02ms (95%)
OLTP test statistics:
    queries performed:
        read:                            669052
        write:                           0
        other:                           0
        total:                           669052
    transactions:                        0      (0.00 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 669052 (3716.57 per sec.)
    other operations:                    0      (0.00 per sec.)

General statistics:
    total time:                          180.0188s
    total number of events:              669052
    total time taken by event execution: 5726.2392s
    response time:
         min:                                  0.28ms
         avg:                                  8.56ms
         max:                                536.19ms
         approx.  95 percentile:              39.75ms

Threads fairness:
    events (avg/stddev):           20907.8750/1855.02
    execution time (avg/stddev):   178.9450/0.14